[
    {
        "Cyklotreky": [
            "Rozhodující je zobrazení trasy ve formátu GPX na mobilu<br>Formát vykreslení tras v mapě se liší v závislosti na tom, na jakém zařízení si databázi otevřete. Zatímco na PC uvidíte trasu primárně ve formě Plánovače Mapy.cz, na mobilu se vám tatáž trasa vykreslí ve formě GPX trasování. Tato forma zobrazení je rychlejší při načítání, geograficky přesnější, neměnná v čase, nezávislá na skriptech Seznamu, nevadí jí neaktuální mapové podklady a zahrnuje vždy i případné využití lanovek, přívozů či jiných doplňujících forem dopravy. Proto se na takto zobrazenou trasu v mobilu lze vždy za všech okolností spolehnout a je tudíž považována za rozhodující při ověřování přesného průběhu každé trasy.",
            "Proč se přesto na PC zobrazují trasy primárně ve formě Plánovače Mapy.cz?<br>Důvodem jsou rozdílné priority při zobrazení databáze doma vs. v terénu. Zatímco na mobilu je prioritou rychlost načítání dat a vysoká přesnost trasování v terénu, doma na PC je nejdůležitejší možnost seznámit se detailně s trasou a projít si jednotlivé zajímavosti v jejím okolí ještě před samotným výletem. Bohužel ale webové Mapy.cz na PC neumožňují klikat na vůbec žádné ikony na mapě, pokud je v mapě v tu chvíli vykreslena trasa ve formě GPX. A jelikož by takové zásadní omezení znemožnilo primární účel zobrazování tras doma před výletem, bylo nutné zvolit na PC variantu zobrazování ve formátu Plánovače.",
            "Jak na PC zobrazit také GPX formát trasy?<br>Momentálně pracuji na technickém řešení, které by dostatečně jednoduchým způsobem umožnilo si na PC nechat vykreslit v mapě také GPX variantu trasy. Jakmile bude toto řešení dokončeno, bude přidáno v rámci jednoho z updatů databáze a následně zde o něm budou uvedeny podrobnosti.",
            "Jak naopak na mobilu zobrazit trasu ve formátu Plánovače?<br>Pokud byste chtěli na trase z databáze využít funkci navigace, budete si ji muset na mobilu zobrazit nikoliv jako výchozí GPX formát, ale ve formě Plánovače, a to proto, že Seznam zatím v mobilní aplikaci neumí navigovat na GPX trasách. Řešením v takovém případě je přihlásit se doma na PC pod vaším Seznam účtem do webu Mapy.cz, poté si v databázi rozkliknout požadovanou trasu a tuto si následně uložit do svého \"Batůžku (Moje Mapy)\". Nakonec si stačí \"Batůžek (Moje Mapy)\" synchronizovat i v mobilní aplikaci a budete ji mít v mobilu ve formě Plánovače k dispozici i pro offline použití.<br>Pozor - Plánovač v mobilu nemusí vždy trasovat stejně jako Plánovač na PC a také kvůli neustálým změnám skriptů Seznamu nelze zaručit přesnost takové trasy!",
            "Počítadlo tras je multifunkční<br>Počítadlo tras na stránkách s cyklo a pěšími trasami nejen zobrazuje počet aktuálně vyfiltrovaných tras na stránce, ale díky barevnému kruhu také graficky znázorňuje, jaký podíl tento počet zobrazených tras představuje vůči celkovému počtu daného typu tras v databázi. Navíc má počítadlo i funkci tlačítka, díky němuž lze jedním kliknutím resetovat filtry a opět na stránce zobrazit všechny trasy daného typu.",
            "Nadpis každé stránky je zároveň tlačítkem<br>Také nadpis stránky má svou speciální funkci tlačítka - díky němu se lze jedním kliknutím vždy vrátit nahoru na stránku, ať už jste odrolovali jakkoliv daleko."
        ]
    },
    {
        "Mapycz": [
            "Jak i na mobilu zobrazit výškový profil trasy?<br>Když se na mobilu prokliknete na jakoukoliv trasu z databáze, neuvidíte u ní výškový profil. Je to kvůli chybě mobilní aplikace Mapy.cz, která neumí zobrazovat výškový profil pro trasy v GPX formátu. Nicméně existuje řešení, jak toto omezení obejít... Stačí, když si v mobilu takto zobrazenou GPX trasu uložíte pod svým Seznam účtem do \"Batůžku (Moje Mapy)\". Potom se výškový profil zobrazí již zcela normálně.",
            "Webová verze Mapy.cz na PC umí vykreslit i více GPX tras najednou<br>Máte-li nějaké trasy uložené v PC jako GPX soubory (ať už exportované z Mapy.cz nebo z jiných aplikací), můžete si takové GPX trasy nechat vykreslit na PC ve webové verzi Mapy.cz. Jednoduše stačí tyto soubory vzít a přetáhnout je do okna prohlížeče s otevřenou mapou na webu Mapy.cz. Takto vykreslené GPX sice neposkytují žádná data o délce trasy či výškovém profilu, ale zase jich lze tímto způsobem zobrazit v mapě i více najednou, což se hodí třeba pro účely plánování, porovnávání apod.",
            "Navigace Mapy.cz funguje i offline<br>Funkce navigování na trase v mobilní aplikaci Mapy.cz funguje i v offline režimu bez nutnosti připojení k internetu, a to včetně hlasových pokynů. Bohužel ale neumí navigovat na GPX trasách, tuto funkci Seznam ještě nepřidal, takže pro potřeby databáze je navigace využitelná primárně při jízdě autem.",
            "Funkce Panorama a 3D mapy jsou dostupné i v mobilní aplikaci<br>I na mobilu lze využít zobrazení Seznam Panorama (Street View) a 3D mapy, i když jsou na první pohled trochu skrytá. Je potřeba kliknout na nějakou zajímavost či libovolný bod na mapě, otevřít si kartu s detaily daného místa a pod titulní fotkou pak najdete odkazy jak na Panorama tak na 3D zobrazení map (pokud jsou pro dané místo k dispozici). Pro oboje zobrazení je potřebné připojení k internetu.",
            "Jak na mobilu rychle změřit vzdálenost mezi dvěma body?<br>Jste-li v terénu a potřebujete rychle změřit orientační vzdálenost mezi dvěma body, stačí v mobilní aplikaci klepnout prsty současně na oba tyto body a aplikace vám mezi nimi ukáže změřenou vzdálenost vzdušnou čarou."
        ]
    },
    {
        "Dopravci": [
            "Skupinová víkendová jízdenka Českých drah<br>Běžně mohou na tuto jízdenku cestovat ve vlacích ČD současně až 2 dospělí a až 3 děti do 15 let. České dráhy ale mívají každoročně speciální jednodenní akci, kdy může tuto jízdenku použít až 5 spolucestujících bez ohledu na jejich věk. Většinou bývá tato akční nabídka k dispozici poslední sobotu v září, je ale dobré si aktuální termín vždy ověřit na webu ČD.",
            "Komplikovanější přeprava kol ve vlacích Arriva<br>Firma Arriva je jediným vlakovým přepravcem, který pro kolo neumožňuje ani nákup ani rezervaci místa online přes své webové stránky. Místo toho vyžadují po zakoupení jízdenky pro cestující následně přepravu kol ještě hlásit a místa pro kola rezervovat přes tým zákaznické péče prostřednictvím emailu nebo zavoláním na číslo 725&nbsp;100&nbsp;725. Pro správnou rezervaci je nutné znát číslo objednávky (R&nbsp;kód), počet kol, trasu a datum, kdy budete s kolem cestovat. Rezervaci je nutné provést v případě jednoho i většího počtu kol."
        ]
    }
]