[
    {
        "Cyklotreky": [
            "<em>Rozhodující je zobrazení trasy ve formátu GPX na mobilu</em><br>Formát vykreslení tras v mapě se liší v závislosti na tom, na jakém zařízení si databázi otevřete. Zatímco na PC uvidíte trasu primárně ve formě Plánovače Mapy.cz, na mobilu se vám tatáž trasa vykreslí ve formě GPX trasování. Tato forma zobrazení je rychlejší při načítání, geograficky přesnější, neměnná v čase, nezávislá na skriptech Seznamu, nevadí jí neaktuální mapové podklady a zahrnuje vždy i případné využití lanovek, přívozů či jiných doplňujících forem dopravy. Proto se na takto zobrazenou trasu v mobilu lze vždy za všech okolností spolehnout a je tudíž považována za rozhodující při ověřování přesného průběhu každé trasy.",
            "<em>Proč se přesto na PC zobrazují trasy primárně ve formě Plánovače Mapy.cz?</em><br>Důvodem jsou rozdílné priority při zobrazení databáze doma vs. v terénu. Zatímco na mobilu je prioritou rychlost načítání dat a vysoká přesnost trasování v terénu (což perfektně splňuje formát GPX), doma na PC je nejdůležitejší mít možnost seznámit se detailně s trasou a projít si jednotlivé zajímavosti v jejím okolí ještě před samotným výletem (v čemž je zase lepší formát Plánovače, který je více interaktivní). Plánovač totiž umožňuje zobrazit i takové detaily, jako např. jak daleko je ten který bod na trase od startu/cíle (z čehož si lze vypočítat i vzdálenosti mezi libovolnými body na trase), upozornit na dočasnou uzavírku nějaké cesty na trase, vypsat itinerář, využít navigaci po trase nebo nabídnout předpověď počasí pro celou trasu až na 4 dny dopředu. Proto se pro PC více hodí formát Plánovače jakožto primární zobrazení, zatímco v mobilu je využitý zase formát GPX.",
            "<em>Jak na PC zobrazit také GPX formát trasy?</em><br>Jestliže si chcete nechat trasu vykreslit na mapě v GPX formátu i na PC (např. pro kontrolu přesného vedení trasy terénem), jednoduše stačí najet myší nad obrázek dané trasy v databázi a zpřístupní se vám odkaz na trasu ve formátu GPX místo Plánovače.",
            "<em>Jak naopak na mobilu zobrazit trasu ve formátu Plánovače?</em><br>Pokud byste chtěli na trase z databáze využít funkci navigace, budete si ji muset na mobilu zobrazit nikoliv jako výchozí GPX formát, ale ve formě Plánovače, a to proto, že Seznam zatím v mobilní aplikaci neumí navigovat na GPX trasách. K zobrazení trasy ve formátu Plánovače na mobilu stačí v panelu s trasou klepnout na políčko s počtem kilometrů.<br><em>Pozor:</em> Plánovač tras Mapy.cz není konzistentní, takže v mobilu nemusí trasovat stejně jako na PC, dokonce může trasovat pokaždé jinak i v mobilu samotném při různých podmínkách (když jste offline vs. když jste online, když jsou neaktuální mapové podklady nebo i podle toho, jakou máte zrovna staženou verzi aplikace Mapy.cz). Navíc kvůli neustálým změnám skriptů Plánovače Mapy.cz nelze zaručit přesnost takové trasy v terénu, takže se může v některých případech lišit od správného zobrazení GPX i dost zásadním způsobem! Při použití trasy ve formátu Plánovače přímo v přírodě je tedy nutné pamatovat na to, že správnost takového zobrazení trasy nemůže být zaručena (na rozdíl od GPX).",
            "<em>Počítadlo tras je multifunkční</em><br>Počítadlo tras na stránkách s cyklo a pěšími trasami nejen zobrazuje počet aktuálně vyfiltrovaných tras na stránce, ale díky barevnému kruhu také graficky znázorňuje, jaký podíl tento počet zobrazených tras představuje vůči celkovému počtu daného typu tras v databázi. Navíc má počítadlo i funkci tlačítka, díky němuž lze jedním kliknutím resetovat filtry a opět na stránce zobrazit všechny trasy daného typu.",
            "<em>Nadpis každé stránky je zároveň tlačítkem</em><br>Také nadpis stránky má svou speciální funkci tlačítka - díky němu se lze jedním kliknutím vždy vrátit nahoru na stránku, ať už jste odrolovali jakkoliv daleko.",
            "<em>Uzamykání pinup girls ve vašem prohlížeči</em><br>Náhodné generování pinup girls při každé návštěvě stránek Cyklotreky funguje dál, nyní máte ale navíc možnost si určitou vámi vybranou pinup girl tzv. \"uzamknout\", to znamená, že při dalších návštěvách stránek Cyklotreky se vám bude zobrazovat tato vámi uzamčená pinup girl místo náhodně vygenerované (a to až do doby, než ji zase manuálně \"odemknete\"). Abyste ale mohli tuto funkcionalitu využít, nesmíte mít v prohlížeči nastavené automatické mazání offline dat stránek při každém vypnutí prohlížeče. Protože pak si váš prohlížeč nemůže vámi uzamknutou pinup girl nijak zapamatovat."
        ]
    },
    {
        "Mapycz": [
            "<em>Mapy.cz už neumí vykreslit více GPX tras najednou</em><br>Vývojáři Mapy.cz od 16.7.2021 zcela změnili systém práce webové aplikace se soubory GPX tras, přičemž touto změnou byla bez náhrady zcela zrušena možnost jednoduchého vykreslení více GPX tras v mapě, která umožňovala nad takto zobrazenými GPX trasami další neomezenou práci v mapě (např. v Plánovači). Aktuálně je tedy možné zobrazit si pouze jedinou GPX trasu a jen prostřednictvím funkce importu a již není možné si zobrazit jak trasu Plánovače, tak i GPX současně, jako to šlo dřív. Podle vyjádření vývojářů Mapy.cz se již pracuje na novém technickém řešení, které by mělo tuto funkcionalitu v nějaké obdobné podobě vrátit zpět do Map, nicméně kdy ke zprovoznění této funkcionality dojde, zatím není známo.",
            "<em>Navigace Mapy.cz funguje i offline</em><br>Funkce navigování na trase v mobilní aplikaci Mapy.cz funguje i v offline režimu bez nutnosti připojení k internetu, a to včetně hlasových pokynů. Bohužel ale neumí navigovat na GPX trasách, tuto funkci Seznam ještě nepřidal, takže pro potřeby databáze je navigace využitelná primárně při jízdě autem.",
            "<em>Export trasy do GPX je možný už i v mobilní aplikaci Mapy.cz</em><br>Naplánovanou trasu či záznam Stopaře již lze exportovat do GPX souboru přímo z mobilní aplikace Mapy.cz (od verze 9.3). Přímý import GPX souboru z telefonu do mobilní aplikace ale zatím Seznam ještě nepodporuje.",
            "<em>Funkce Panorama a 3D mapy jsou dostupné i v mobilní aplikaci</em><br>I na mobilu lze využít zobrazení Seznam Panorama (Street View) a 3D mapy, i když jsou na první pohled trochu skrytá. Je potřeba kliknout na nějakou zajímavost či libovolný bod na mapě, otevřít si kartu s detaily daného místa a pod titulní fotkou pak najdete odkazy jak na Panorama tak na 3D zobrazení map (pokud jsou pro dané místo k dispozici). Pro oboje zobrazení je potřebné připojení k internetu.",
            "<em>Jak na mobilu rychle změřit vzdálenost mezi dvěma body?</em><br>Jste-li v terénu a potřebujete rychle změřit orientační vzdálenost mezi dvěma body, stačí v mobilní aplikaci klepnout prsty současně na oba tyto body a aplikace vám mezi nimi ukáže změřenou vzdálenost vzdušnou čarou."
        ]
    },
    {
        "Dopravci": [
            "<em>Jednotná jízdenka na železnici (OneTicket)</em><br>Od roku 2021 lze využívat v běžném provozu službu Jednotné jízdenky na železnici (OneTicket). Tato jízdenka je povinně uznatelná všemi vlakovými dopravci v ČR na všech spojích provozovaných v tzv. závazku veřejné služby (dotované spoje). Cena OneTicket se odvíjí podle počtu ujetých kilometrů a vychází sice mírně dráž než běžné nabídky jednotlivých dopravců, nicméně v případě, kdy je nutné pro jednu trasu kombinovat vlaky několika různých dopravců, se tato forma jízdenky díky své jednoduchosti určitě vyplatí. Od 1.7.2021 lze OneTicket uplatnit také na většině komerčních vlakových spojů a v plánu je její budoucí zavedení i na autobusové linky.",
            "<em>Skupinová víkendová jízdenka Českých drah</em><br>Běžně mohou na tuto jízdenku cestovat ve vlacích ČD současně až 2 dospělí a až 3 děti do 15 let. České dráhy ale mívají každoročně speciální jednodenní akci, kdy může tuto jízdenku použít až 5 spolucestujících bez ohledu na jejich věk. Většinou bývá tato akční nabídka k dispozici poslední sobotu v září, je ale dobré si aktuální termín vždy ověřit na webu ČD.",
            "<em>Včasná jízdenka Evropa (ČD)</em><br>Pro cestování vlakem do blízkého zahraničí se vyplatí koupit s časovým předstihem Včasnou jízdenku Evropa (lze zakoupit až 2 měsíce dopředu). Taková jízdenka totiž vychází výrazně levněji než klasická Mezinárodní jízdenka ČD, čímž lze i výlet v zahraničí udržet cenově přijatelným.",
            "<em>Vlaková jízdenka od zahraničního dopravce při cestě do zahraničí</em><br>Při cestování vlakem do blízkého zahraničí je dobré si pro vybranou cestu ověřit také nabídky zahraničních vlakových dopravců. Ti totiž často mohou nabízet vlakové jízdenky za podstatně nižší ceny, než jsou standartní Mezinárodní jízdenky ČD. Takové jízdenky přitom mají úplně stejnou platnost, tj. jak v českém, tak v zahraničním úseku vybrané trasy.",
            "<em>Komplikovanější přeprava kol ve vlacích Arriva</em><br>Firma Arriva je jediným vlakovým přepravcem, který pro kolo neumožňuje ani nákup ani rezervaci místa online přes své webové stránky. Místo toho vyžadují po zakoupení jízdenky pro cestující následně přepravu kol ještě hlásit a místa pro kola rezervovat přes tým zákaznické péče prostřednictvím emailu nebo zavoláním na číslo 725&nbsp;100&nbsp;725. Pro správnou rezervaci je nutné znát číslo objednávky (R&nbsp;kód), počet kol, trasu a datum, kdy budete s kolem cestovat. Rezervaci je nutné provést v případě jednoho i většího počtu kol.",
            "<em>Cyklobusy IDS JMK</em><br>Jelikož sezónní cyklobusy IDS JMK jezdí v rámci běžných autobusových linek, přepravují jízdní kola vždy jen vybrané autobusy na těchto linkách. Je tedy nutné vždy ověřit, který konkrétní autobus na dané lince jezdí s cyklopřívěsem (podle symbolu jízdního kola v jízdním řádu dané autobusové linky na webu IDS JMK). Navíc lze na linkách cyklobusů nastoupit a vystoupit s jízdním kolem pouze na určených zastávkách (tyto zastávky lze identifikovat taktéž podle symbolu jízdního kola v jízdním řádu)."
        ]
    }
]